package cards

const hokModernAlbumID = "hok-modern-s1"

var hokModernLegendaryRare = []string{
	"甄姬", "张良", "西施", "艾琳", "嫦娥", "王维",
	"朵莉亚", "李白", "少司缘", "杨戬",
}

var hokModernLegendary = []string{
	"王昭君", "貂蝉", "大乔", "公孙离", "杨玉环", "海月",
	"女娲", "上官婉儿", "诸葛亮", "赵云", "铠", "海诺",
	"敖隐", "露娜", "虞姬", "不知火舞", "镜", "孙权",
}

var hokModernEpic = []string{
	"妲己", "瑶", "小乔", "花木兰", "孙尚香", "韩信",
	"橘右京", "嬴政", "武则天", "伽罗", "李信", "马超",
	"司马懿", "云中君", "曜", "澜", "云缨", "大司命",
	"亚连", "影", "蔡文姬", "孙悟空", "明世隐", "卢雅那",
}

var hokModernRare = []string{
	"亚瑟", "后羿", "鲁班七号", "梦奇", "庄周", "高渐离",
	"阿轲", "芈月", "吕布", "周瑜", "宫本武藏", "狄仁杰",
	"安琪拉", "兰陵王", "娜可露露", "雅典娜", "哪吒", "百里守约",
	"百里玄策", "弈星", "孙策", "夏洛特", "暃", "姬小满",
	"空空儿", "大禹", "东皇太一", "干将莫邪", "元歌", "沈梦溪",
	"阿古朵", "苍",
}

var hokModernCommon = []string{
	"程咬金", "太乙真人", "廉颇", "墨子", "刘禅", "钟无艳",
	"孙膑", "扁鹊", "白起", "夏侯惇", "曹操", "典韦",
	"马可波罗", "达摩", "项羽", "老夫子", "关羽", "姜子牙",
	"刘邦", "牛魔", "刘备", "张飞", "李元芳", "钟馗",
	"黄忠", "鬼谷子", "苏烈", "裴擒虎", "狂铁", "米莱狄",
	"盾山", "猪八戒", "盘古", "鲁班大师", "蒙犽", "蒙恬",
	"司空震", "金蝉", "桑启", "戈娅", "赵怀真", "莱西奥",
	"元流之子", "蚩奼",
}
